app/Controllers/Admin.php

SELECT *
FROM `admin`
WHERE `username` = 'admin'
---
    public function index()
    {
        if(!session('username')){
            session()->setFlashdata('pesan', '<div class="alert alert-danger alert-message" role="alert">Akses ditolak, anda belum login!</div>');
            return redirect()->to('login/gagal');
        }

        $db = \Config\Database::connect();

        $data = [
            'judul' => 'Admin Panel',
            'user' => $db->table('admin')->getWhere(['username' => session('username')])->getRowArray(),