app/Controllers/TiketController.php

INSERT INTO `tiket` (`id_user`, `id_tiketbus`, `nama`, `hp`, `jumlah`, `asal`, `tujuan`, `tanggal`, `jam`, `satuan`, `total`) VALUES ('8', '2', 'debai', '081395974344', '5', 'Jakarta', 'Bandung', '18/06/2022', '10:00', '110000', '550000')
SELECT *
FROM `tiketbus`
WHERE `id` = 2
UPDATE `tiketbus` SET `tersedia` = 35
WHERE `id` = 2
---
    public function pesan()
    {
        $model = new TiketModel();
        $data = $this->request->getPost();
        $db = \Config\Database::connect();

        if(!$model->save($data)){
            return $this->fail($model->errors());
        }else{
            $id = $db->table('tiket')->getWhere($data)->getRowArray();
            $data = [
                'code' => 200,
                'status' => true,
                'id' => $id['id'],
                'data' => $data
            ];

            $idtiket = intval($this->request->getPost('id_tiketbus'));
            $jumlah = intval($this->request->getPost('jumlah'));
            $tiket = $db->table('tiketbus')->getWhere(['id' => $idtiket])->getRowArray();
            $tiketbus = $tiket['tersedia'];
            $total = $tiketbus - $jumlah;
            $db->table('tiketbus')->set('tersedia', $total)->where(['id' => $idtiket])->update();

SELECT *
FROM `tiket`
WHERE `id_user` = ('8')
AND `status` = 'Sudah Bayar'
---
    public function cetak()
    {
        $db = \Config\Database::connect();
        $iduser = $this->request->getPost();
        $get = $db->table('tiket')->getWhere(['id_user' => $iduser, 'status' => 'Sudah Bayar'])->getResultArray();

SELECT *
FROM `tiket`
WHERE `id` = '29'
AND `nama` = 'fadhil'
---
    public function batal()
    {
        $db = \Config\Database::connect();
        $id = $this->request->getPost('id');
        $nama = $this->request->getPost('nama');
        $cek = $db->table('tiket')->getWhere(['id' => $id, 'nama' => $nama])->getRowArray();