app/Controllers/Transaksi.php

    public function penjadwalan()
    {
        if(!session('username')){
            session()->setFlashdata('pesan', '<div class="alert alert-danger alert-message" role="alert">Akses ditolak, anda belum login!</div>');
            return redirect()->to('login/gagal');
        }

        $db = \Config\Database::connect();

        $data = [
            'judul' => 'Jadwal',
            'user' => $db->table('admin')->getWhere(['username' => session('username')])->getRowArray(),
            'validation' => \Config\Services::validation(),
            'jadwal' => $db->table('tiketbus')->get()->getResultArray(),
            'asal' => $db->table('asal')->get()->getResultArray(),
            'tujuan' => $db->table('tujuan')->get()->getResultArray()
---
SELECT *
FROM `admin`
WHERE `username` = 'admin'
SELECT *
FROM `tiketbus`
SELECT *
FROM `asal`
SELECT *
FROM `tujuan`

    public function pemesanan()
    {
        if(!session('username')){
            session()->setFlashdata('pesan', '<div class="alert alert-danger alert-message" role="alert">Akses ditolak, anda belum login!</div>');
            return redirect()->to('login/gagal');
        }

        $db = \Config\Database::connect();

        $data = [
            'judul' => 'Jadwal',
            'user' => $db->table('admin')->getWhere(['username' => session('username')])->getRowArray(),
            'validation' => \Config\Services::validation(),
            'data' => $db->table('tiket ')->get()->getResultArray(),
---
SELECT *
FROM `admin`
WHERE `username` = 'admin'
SELECT *
FROM `tiket`