app/Controllers/UserController.php

SELECT *
FROM `user`
---
    public function index()
    {
        $model = new UserModel();
        $data = $model->findAll();

SELECT *
FROM `user`
WHERE `email` = 'sriyadi.sry@bsi.ac.id'
---
    public function login()
    {
        $db = \Config\Database::connect();
        $email = $this->request->getPost('email');
        $password = md5($this->request->getPost('password'));
        $user = $db->table('user')->getWhere(['email' => $email])->getRowArray();